---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCConnectedWallData.ElementId
source: html/d935a90c-e2c0-cd2b-8e55-1044676bb570.htm
---
# Autodesk.Revit.DB.IFC.IFCConnectedWallData.ElementId Property

The element id to which this element is joined.

## Syntax (C#)
```csharp
public ElementId ElementId { get; }
```